{
	"nodes":[
		{"op":"null","name":"Input","inputs":[]},
		{"op":"null","name":"1.Weights","inputs":[]},
		{"op":"null","name":"1.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1","attrs":{"no_bias":"False","num_hidden":"8192"},"inputs":[[0,0,0],[1,0,0],[2,0,0]]},
		{"op":"Reshape","name":"2.1","attrs":{"shape":"(-1, 512, 4, 4)"},"inputs":[[3,0,0]]},
		{"op":"LeakyReLU","name":"2.2.0","attrs":{"act_type":"leaky","slope":"0.2e0"},"inputs":[[4,0,0]]},
		{"op":"square","name":"2.3.0","inputs":[[5,0,0]]},
		{"op":"mean","name":"2.3.1","attrs":{"axis":"1","keepdims":"true"},"inputs":[[6,0,0]]},
		{"op":"_plus_scalar","name":"2.3.2","attrs":{"scalar":"0.1e-7"},"inputs":[[7,0,0]]},
		{"op":"rsqrt","name":"2.3.3","inputs":[[8,0,0]]},
		{"op":"broadcast_mul","name":"2.3.4","inputs":[[5,0,0],[9,0,0]]},
		{"op":"null","name":"2.4.Weights","inputs":[]},
		{"op":"null","name":"2.4.Biases","inputs":[]},
		{"op":"Convolution","name":"2.4","attrs":{"dilate":"(1, 1)","kernel":"(3, 3)","layout":"None","no_bias":"False","num_filter":"512","num_group":"1","pad":"(1, 1)","stride":"(1, 1)"},"inputs":[[10,0,0],[11,0,0],[12,0,0]]},
		{"op":"LeakyReLU","name":"2.5.0","attrs":{"act_type":"leaky","slope":"0.2e0"},"inputs":[[13,0,0]]},
		{"op":"square","name":"2.6.0","inputs":[[14,0,0]]},
		{"op":"mean","name":"2.6.1","attrs":{"axis":"1","keepdims":"true"},"inputs":[[15,0,0]]},
		{"op":"_plus_scalar","name":"2.6.2","attrs":{"scalar":"0.1e-7"},"inputs":[[16,0,0]]},
		{"op":"rsqrt","name":"2.6.3","inputs":[[17,0,0]]},
		{"op":"broadcast_mul","name":"2.6.4","inputs":[[14,0,0],[18,0,0]]},
		{"op":"UpSampling","name":"3.1.0","attrs":{"num_args":"1","sample_type":"nearest","scale":"2"},"inputs":[[19,0,0]]},
		{"op":"null","name":"3.2.Weights","inputs":[]},
		{"op":"null","name":"3.2.Biases","inputs":[]},
		{"op":"Convolution","name":"3.2","attrs":{"dilate":"(1, 1)","kernel":"(3, 3)","layout":"None","no_bias":"False","num_filter":"512","num_group":"1","pad":"(1, 1)","stride":"(1, 1)"},"inputs":[[20,0,0],[21,0,0],[22,0,0]]},
		{"op":"LeakyReLU","name":"3.3.0","attrs":{"act_type":"leaky","slope":"0.2e0"},"inputs":[[23,0,0]]},
		{"op":"square","name":"3.4.0","inputs":[[24,0,0]]},
		{"op":"mean","name":"3.4.1","attrs":{"axis":"1","keepdims":"true"},"inputs":[[25,0,0]]},
		{"op":"_plus_scalar","name":"3.4.2","attrs":{"scalar":"0.1e-7"},"inputs":[[26,0,0]]},
		{"op":"rsqrt","name":"3.4.3","inputs":[[27,0,0]]},
		{"op":"broadcast_mul","name":"3.4.4","inputs":[[24,0,0],[28,0,0]]},
		{"op":"null","name":"3.5.Weights","inputs":[]},
		{"op":"null","name":"3.5.Biases","inputs":[]},
		{"op":"Convolution","name":"3.5","attrs":{"dilate":"(1, 1)","kernel":"(3, 3)","layout":"None","no_bias":"False","num_filter":"512","num_group":"1","pad":"(1, 1)","stride":"(1, 1)"},"inputs":[[29,0,0],[30,0,0],[31,0,0]]},
		{"op":"LeakyReLU","name":"3.6.0","attrs":{"act_type":"leaky","slope":"0.2e0"},"inputs":[[32,0,0]]},
		{"op":"square","name":"3.7.0","inputs":[[33,0,0]]},
		{"op":"mean","name":"3.7.1","attrs":{"axis":"1","keepdims":"true"},"inputs":[[34,0,0]]},
		{"op":"_plus_scalar","name":"3.7.2","attrs":{"scalar":"0.1e-7"},"inputs":[[35,0,0]]},
		{"op":"rsqrt","name":"3.7.3","inputs":[[36,0,0]]},
		{"op":"broadcast_mul","name":"3.7.4","inputs":[[33,0,0],[37,0,0]]},
		{"op":"UpSampling","name":"4.1.0","attrs":{"num_args":"1","sample_type":"nearest","scale":"2"},"inputs":[[38,0,0]]},
		{"op":"null","name":"4.2.Weights","inputs":[]},
		{"op":"null","name":"4.2.Biases","inputs":[]},
		{"op":"Convolution","name":"4.2","attrs":{"dilate":"(1, 1)","kernel":"(3, 3)","layout":"None","no_bias":"False","num_filter":"512","num_group":"1","pad":"(1, 1)","stride":"(1, 1)"},"inputs":[[39,0,0],[40,0,0],[41,0,0]]},
		{"op":"LeakyReLU","name":"4.3.0","attrs":{"act_type":"leaky","slope":"0.2e0"},"inputs":[[42,0,0]]},
		{"op":"square","name":"4.4.0","inputs":[[43,0,0]]},
		{"op":"mean","name":"4.4.1","attrs":{"axis":"1","keepdims":"true"},"inputs":[[44,0,0]]},
		{"op":"_plus_scalar","name":"4.4.2","attrs":{"scalar":"0.1e-7"},"inputs":[[45,0,0]]},
		{"op":"rsqrt","name":"4.4.3","inputs":[[46,0,0]]},
		{"op":"broadcast_mul","name":"4.4.4","inputs":[[43,0,0],[47,0,0]]},
		{"op":"null","name":"4.5.Weights","inputs":[]},
		{"op":"null","name":"4.5.Biases","inputs":[]},
		{"op":"Convolution","name":"4.5","attrs":{"dilate":"(1, 1)","kernel":"(3, 3)","layout":"None","no_bias":"False","num_filter":"512","num_group":"1","pad":"(1, 1)","stride":"(1, 1)"},"inputs":[[48,0,0],[49,0,0],[50,0,0]]},
		{"op":"LeakyReLU","name":"4.6.0","attrs":{"act_type":"leaky","slope":"0.2e0"},"inputs":[[51,0,0]]},
		{"op":"square","name":"4.7.0","inputs":[[52,0,0]]},
		{"op":"mean","name":"4.7.1","attrs":{"axis":"1","keepdims":"true"},"inputs":[[53,0,0]]},
		{"op":"_plus_scalar","name":"4.7.2","attrs":{"scalar":"0.1e-7"},"inputs":[[54,0,0]]},
		{"op":"rsqrt","name":"4.7.3","inputs":[[55,0,0]]},
		{"op":"broadcast_mul","name":"4.7.4","inputs":[[52,0,0],[56,0,0]]},
		{"op":"UpSampling","name":"5.1.0","attrs":{"num_args":"1","sample_type":"nearest","scale":"2"},"inputs":[[57,0,0]]},
		{"op":"null","name":"5.2.Weights","inputs":[]},
		{"op":"null","name":"5.2.Biases","inputs":[]},
		{"op":"Convolution","name":"5.2","attrs":{"dilate":"(1, 1)","kernel":"(3, 3)","layout":"None","no_bias":"False","num_filter":"512","num_group":"1","pad":"(1, 1)","stride":"(1, 1)"},"inputs":[[58,0,0],[59,0,0],[60,0,0]]},
		{"op":"LeakyReLU","name":"5.3.0","attrs":{"act_type":"leaky","slope":"0.2e0"},"inputs":[[61,0,0]]},
		{"op":"square","name":"5.4.0","inputs":[[62,0,0]]},
		{"op":"mean","name":"5.4.1","attrs":{"axis":"1","keepdims":"true"},"inputs":[[63,0,0]]},
		{"op":"_plus_scalar","name":"5.4.2","attrs":{"scalar":"0.1e-7"},"inputs":[[64,0,0]]},
		{"op":"rsqrt","name":"5.4.3","inputs":[[65,0,0]]},
		{"op":"broadcast_mul","name":"5.4.4","inputs":[[62,0,0],[66,0,0]]},
		{"op":"null","name":"5.5.Weights","inputs":[]},
		{"op":"null","name":"5.5.Biases","inputs":[]},
		{"op":"Convolution","name":"5.5","attrs":{"dilate":"(1, 1)","kernel":"(3, 3)","layout":"None","no_bias":"False","num_filter":"512","num_group":"1","pad":"(1, 1)","stride":"(1, 1)"},"inputs":[[67,0,0],[68,0,0],[69,0,0]]},
		{"op":"LeakyReLU","name":"5.6.0","attrs":{"act_type":"leaky","slope":"0.2e0"},"inputs":[[70,0,0]]},
		{"op":"square","name":"5.7.0","inputs":[[71,0,0]]},
		{"op":"mean","name":"5.7.1","attrs":{"axis":"1","keepdims":"true"},"inputs":[[72,0,0]]},
		{"op":"_plus_scalar","name":"5.7.2","attrs":{"scalar":"0.1e-7"},"inputs":[[73,0,0]]},
		{"op":"rsqrt","name":"5.7.3","inputs":[[74,0,0]]},
		{"op":"broadcast_mul","name":"5.7.4","inputs":[[71,0,0],[75,0,0]]},
		{"op":"UpSampling","name":"6.1.0","attrs":{"num_args":"1","sample_type":"nearest","scale":"2"},"inputs":[[76,0,0]]},
		{"op":"null","name":"6.2.Weights","inputs":[]},
		{"op":"null","name":"6.2.Biases","inputs":[]},
		{"op":"Convolution","name":"6.2","attrs":{"dilate":"(1, 1)","kernel":"(3, 3)","layout":"None","no_bias":"False","num_filter":"256","num_group":"1","pad":"(1, 1)","stride":"(1, 1)"},"inputs":[[77,0,0],[78,0,0],[79,0,0]]},
		{"op":"LeakyReLU","name":"6.3.0","attrs":{"act_type":"leaky","slope":"0.2e0"},"inputs":[[80,0,0]]},
		{"op":"square","name":"6.4.0","inputs":[[81,0,0]]},
		{"op":"mean","name":"6.4.1","attrs":{"axis":"1","keepdims":"true"},"inputs":[[82,0,0]]},
		{"op":"_plus_scalar","name":"6.4.2","attrs":{"scalar":"0.1e-7"},"inputs":[[83,0,0]]},
		{"op":"rsqrt","name":"6.4.3","inputs":[[84,0,0]]},
		{"op":"broadcast_mul","name":"6.4.4","inputs":[[81,0,0],[85,0,0]]},
		{"op":"null","name":"6.5.Weights","inputs":[]},
		{"op":"null","name":"6.5.Biases","inputs":[]},
		{"op":"Convolution","name":"6.5","attrs":{"dilate":"(1, 1)","kernel":"(3, 3)","layout":"None","no_bias":"False","num_filter":"256","num_group":"1","pad":"(1, 1)","stride":"(1, 1)"},"inputs":[[86,0,0],[87,0,0],[88,0,0]]},
		{"op":"LeakyReLU","name":"6.6.0","attrs":{"act_type":"leaky","slope":"0.2e0"},"inputs":[[89,0,0]]},
		{"op":"square","name":"6.7.0","inputs":[[90,0,0]]},
		{"op":"mean","name":"6.7.1","attrs":{"axis":"1","keepdims":"true"},"inputs":[[91,0,0]]},
		{"op":"_plus_scalar","name":"6.7.2","attrs":{"scalar":"0.1e-7"},"inputs":[[92,0,0]]},
		{"op":"rsqrt","name":"6.7.3","inputs":[[93,0,0]]},
		{"op":"broadcast_mul","name":"6.7.4","inputs":[[90,0,0],[94,0,0]]},
		{"op":"UpSampling","name":"7.1.0","attrs":{"num_args":"1","sample_type":"nearest","scale":"2"},"inputs":[[95,0,0]]},
		{"op":"null","name":"7.2.Weights","inputs":[]},
		{"op":"null","name":"7.2.Biases","inputs":[]},
		{"op":"Convolution","name":"7.2","attrs":{"dilate":"(1, 1)","kernel":"(3, 3)","layout":"None","no_bias":"False","num_filter":"128","num_group":"1","pad":"(1, 1)","stride":"(1, 1)"},"inputs":[[96,0,0],[97,0,0],[98,0,0]]},
		{"op":"LeakyReLU","name":"7.3.0","attrs":{"act_type":"leaky","slope":"0.2e0"},"inputs":[[99,0,0]]},
		{"op":"square","name":"7.4.0","inputs":[[100,0,0]]},
		{"op":"mean","name":"7.4.1","attrs":{"axis":"1","keepdims":"true"},"inputs":[[101,0,0]]},
		{"op":"_plus_scalar","name":"7.4.2","attrs":{"scalar":"0.1e-7"},"inputs":[[102,0,0]]},
		{"op":"rsqrt","name":"7.4.3","inputs":[[103,0,0]]},
		{"op":"broadcast_mul","name":"7.4.4","inputs":[[100,0,0],[104,0,0]]},
		{"op":"null","name":"7.5.Weights","inputs":[]},
		{"op":"null","name":"7.5.Biases","inputs":[]},
		{"op":"Convolution","name":"7.5","attrs":{"dilate":"(1, 1)","kernel":"(3, 3)","layout":"None","no_bias":"False","num_filter":"128","num_group":"1","pad":"(1, 1)","stride":"(1, 1)"},"inputs":[[105,0,0],[106,0,0],[107,0,0]]},
		{"op":"LeakyReLU","name":"7.6.0","attrs":{"act_type":"leaky","slope":"0.2e0"},"inputs":[[108,0,0]]},
		{"op":"square","name":"7.7.0","inputs":[[109,0,0]]},
		{"op":"mean","name":"7.7.1","attrs":{"axis":"1","keepdims":"true"},"inputs":[[110,0,0]]},
		{"op":"_plus_scalar","name":"7.7.2","attrs":{"scalar":"0.1e-7"},"inputs":[[111,0,0]]},
		{"op":"rsqrt","name":"7.7.3","inputs":[[112,0,0]]},
		{"op":"broadcast_mul","name":"7.7.4","inputs":[[109,0,0],[113,0,0]]},
		{"op":"UpSampling","name":"8.1.0","attrs":{"num_args":"1","sample_type":"nearest","scale":"2"},"inputs":[[114,0,0]]},
		{"op":"null","name":"8.2.Weights","inputs":[]},
		{"op":"null","name":"8.2.Biases","inputs":[]},
		{"op":"Convolution","name":"8.2","attrs":{"dilate":"(1, 1)","kernel":"(3, 3)","layout":"None","no_bias":"False","num_filter":"64","num_group":"1","pad":"(1, 1)","stride":"(1, 1)"},"inputs":[[115,0,0],[116,0,0],[117,0,0]]},
		{"op":"LeakyReLU","name":"8.3.0","attrs":{"act_type":"leaky","slope":"0.2e0"},"inputs":[[118,0,0]]},
		{"op":"square","name":"8.4.0","inputs":[[119,0,0]]},
		{"op":"mean","name":"8.4.1","attrs":{"axis":"1","keepdims":"true"},"inputs":[[120,0,0]]},
		{"op":"_plus_scalar","name":"8.4.2","attrs":{"scalar":"0.1e-7"},"inputs":[[121,0,0]]},
		{"op":"rsqrt","name":"8.4.3","inputs":[[122,0,0]]},
		{"op":"broadcast_mul","name":"8.4.4","inputs":[[119,0,0],[123,0,0]]},
		{"op":"null","name":"8.5.Weights","inputs":[]},
		{"op":"null","name":"8.5.Biases","inputs":[]},
		{"op":"Convolution","name":"8.5","attrs":{"dilate":"(1, 1)","kernel":"(3, 3)","layout":"None","no_bias":"False","num_filter":"64","num_group":"1","pad":"(1, 1)","stride":"(1, 1)"},"inputs":[[124,0,0],[125,0,0],[126,0,0]]},
		{"op":"LeakyReLU","name":"8.6.0","attrs":{"act_type":"leaky","slope":"0.2e0"},"inputs":[[127,0,0]]},
		{"op":"square","name":"8.7.0","inputs":[[128,0,0]]},
		{"op":"mean","name":"8.7.1","attrs":{"axis":"1","keepdims":"true"},"inputs":[[129,0,0]]},
		{"op":"_plus_scalar","name":"8.7.2","attrs":{"scalar":"0.1e-7"},"inputs":[[130,0,0]]},
		{"op":"rsqrt","name":"8.7.3","inputs":[[131,0,0]]},
		{"op":"broadcast_mul","name":"8.7.4","inputs":[[128,0,0],[132,0,0]]},
		{"op":"UpSampling","name":"9.1.0","attrs":{"num_args":"1","sample_type":"nearest","scale":"2"},"inputs":[[133,0,0]]},
		{"op":"null","name":"9.2.Weights","inputs":[]},
		{"op":"null","name":"9.2.Biases","inputs":[]},
		{"op":"Convolution","name":"9.2","attrs":{"dilate":"(1, 1)","kernel":"(3, 3)","layout":"None","no_bias":"False","num_filter":"32","num_group":"1","pad":"(1, 1)","stride":"(1, 1)"},"inputs":[[134,0,0],[135,0,0],[136,0,0]]},
		{"op":"LeakyReLU","name":"9.3.0","attrs":{"act_type":"leaky","slope":"0.2e0"},"inputs":[[137,0,0]]},
		{"op":"square","name":"9.4.0","inputs":[[138,0,0]]},
		{"op":"mean","name":"9.4.1","attrs":{"axis":"1","keepdims":"true"},"inputs":[[139,0,0]]},
		{"op":"_plus_scalar","name":"9.4.2","attrs":{"scalar":"0.1e-7"},"inputs":[[140,0,0]]},
		{"op":"rsqrt","name":"9.4.3","inputs":[[141,0,0]]},
		{"op":"broadcast_mul","name":"9.4.4","inputs":[[138,0,0],[142,0,0]]},
		{"op":"null","name":"9.5.Weights","inputs":[]},
		{"op":"null","name":"9.5.Biases","inputs":[]},
		{"op":"Convolution","name":"9.5","attrs":{"dilate":"(1, 1)","kernel":"(3, 3)","layout":"None","no_bias":"False","num_filter":"32","num_group":"1","pad":"(1, 1)","stride":"(1, 1)"},"inputs":[[143,0,0],[144,0,0],[145,0,0]]},
		{"op":"LeakyReLU","name":"9.6.0","attrs":{"act_type":"leaky","slope":"0.2e0"},"inputs":[[146,0,0]]},
		{"op":"square","name":"9.7.0","inputs":[[147,0,0]]},
		{"op":"mean","name":"9.7.1","attrs":{"axis":"1","keepdims":"true"},"inputs":[[148,0,0]]},
		{"op":"_plus_scalar","name":"9.7.2","attrs":{"scalar":"0.1e-7"},"inputs":[[149,0,0]]},
		{"op":"rsqrt","name":"9.7.3","inputs":[[150,0,0]]},
		{"op":"broadcast_mul","name":"9.7.4","inputs":[[147,0,0],[151,0,0]]},
		{"op":"UpSampling","name":"10.1.0","attrs":{"num_args":"1","sample_type":"nearest","scale":"2"},"inputs":[[152,0,0]]},
		{"op":"null","name":"10.2.Weights","inputs":[]},
		{"op":"null","name":"10.2.Biases","inputs":[]},
		{"op":"Convolution","name":"10.2","attrs":{"dilate":"(1, 1)","kernel":"(3, 3)","layout":"None","no_bias":"False","num_filter":"16","num_group":"1","pad":"(1, 1)","stride":"(1, 1)"},"inputs":[[153,0,0],[154,0,0],[155,0,0]]},
		{"op":"LeakyReLU","name":"10.3.0","attrs":{"act_type":"leaky","slope":"0.2e0"},"inputs":[[156,0,0]]},
		{"op":"square","name":"10.4.0","inputs":[[157,0,0]]},
		{"op":"mean","name":"10.4.1","attrs":{"axis":"1","keepdims":"true"},"inputs":[[158,0,0]]},
		{"op":"_plus_scalar","name":"10.4.2","attrs":{"scalar":"0.1e-7"},"inputs":[[159,0,0]]},
		{"op":"rsqrt","name":"10.4.3","inputs":[[160,0,0]]},
		{"op":"broadcast_mul","name":"10.4.4","inputs":[[157,0,0],[161,0,0]]},
		{"op":"null","name":"10.5.Weights","inputs":[]},
		{"op":"null","name":"10.5.Biases","inputs":[]},
		{"op":"Convolution","name":"10.5","attrs":{"dilate":"(1, 1)","kernel":"(3, 3)","layout":"None","no_bias":"False","num_filter":"16","num_group":"1","pad":"(1, 1)","stride":"(1, 1)"},"inputs":[[162,0,0],[163,0,0],[164,0,0]]},
		{"op":"LeakyReLU","name":"10.6.0","attrs":{"act_type":"leaky","slope":"0.2e0"},"inputs":[[165,0,0]]},
		{"op":"square","name":"10.7.0","inputs":[[166,0,0]]},
		{"op":"mean","name":"10.7.1","attrs":{"axis":"1","keepdims":"true"},"inputs":[[167,0,0]]},
		{"op":"_plus_scalar","name":"10.7.2","attrs":{"scalar":"0.1e-7"},"inputs":[[168,0,0]]},
		{"op":"rsqrt","name":"10.7.3","inputs":[[169,0,0]]},
		{"op":"broadcast_mul","name":"10.7.4","inputs":[[166,0,0],[170,0,0]]},
		{"op":"null","name":"11.Weights","inputs":[]},
		{"op":"null","name":"11.Biases","inputs":[]},
		{"op":"Convolution","name":"11","attrs":{"dilate":"(1, 1)","kernel":"(1, 1)","layout":"None","no_bias":"False","num_filter":"3","num_group":"1","pad":"(0, 0)","stride":"(1, 1)"},"inputs":[[171,0,0],[172,0,0],[173,0,0]]},
		{"op":"_copy","name":"Output","inputs":[[174,0,0]]}
	],
	"arg_nodes":[0,1,2,11,12,21,22,30,31,40,41,49,50,59,60,68,69,78,79,87,88,97,98,106,107,116,117,125,126,135,136,144,145,154,155,163,164,172,173],
	"node_row_ptr":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176],
	"heads":[
		[175,0,0]
	],
	"attrs":{
		"mxnet_version":["int",10001]
	}
}